ryankurte/efm32-base/device/BGM21/Include/bgm210l022jif1.h
/** Flash and SRAM limits for BGM210L022JIF1 */
#define FLASH_BASE                                 (0x00000000UL)               /**< Flash Base Address */
#define FLASH_SIZE                                 (0x00100000UL)               /**< Available Flash Memory */
#define FLASH_PAGE_SIZE                            (1UL << MSC_MAIN_PSIZE_BITS) /**< Flash Memory page size */
#define SRAM_BASE                                  (0x20000000UL)               /**< SRAM Base Address */
#define SRAM_SIZE                                  (0x00018000UL)               /**< Available SRAM Memory */
#define DMA_CHAN_COUNT                             LDMA_CH_NUM                  /**< Number of DMA channels */
#define EXT_IRQ_COUNT                              61                           /**< Number of External (NVIC) interrupts */

/* GPIO Avalibility Info */
#define GPIO_PA_INDEX                              0U         /**< Index of port PA */
#define GPIO_PA_COUNT                              4U         /**< Number of pins on port PA */
#define GPIO_PA_MASK                               (0x001EUL) /**< Port PA pin mask */
#define GPIO_PA_PIN1                               1U         /**< GPIO pin PA1 is present. */
#define GPIO_PA_PIN2                               1U         /**< GPIO pin PA2 is present. */
#define GPIO_PA_PIN3                               1U         /**< GPIO pin PA3 is present. */
#define GPIO_PA_PIN4                               1U         /**< GPIO pin PA4 is present. */
#define GPIO_PB_INDEX                              1U         /**< Index of port PB */
#define GPIO_PB_COUNT                              0U         /**< Number of pins on port PB */
#define GPIO_PB_MASK                               (0x0000UL) /**< Port PB pin mask */
#define GPIO_PC_INDEX                              2U         /**< Index of port PC */
#define GPIO_PC_COUNT                              6U         /**< Number of pins on port PC */
#define GPIO_PC_MASK                               (0x003FUL) /**< Port PC pin mask */
#define GPIO_PC_PIN0                               1U         /**< GPIO pin PC0 is present. */
#define GPIO_PC_PIN1                               1U         /**< GPIO pin PC1 is present. */
#define GPIO_PC_PIN2                               1U         /**< GPIO pin PC2 is present. */
#define GPIO_PC_PIN3                               1U         /**< GPIO pin PC3 is present. */
#define GPIO_PC_PIN4                               1U         /**< GPIO pin PC4 is present. */
#define GPIO_PC_PIN5                               1U         /**< GPIO pin PC5 is present. */
#define GPIO_PD_INDEX                              3U         /**< Index of port PD */
#define GPIO_PD_COUNT                              2U         /**< Number of pins on port PD */
#define GPIO_PD_MASK                               (0x0003UL) /**< Port PD pin mask */
#define GPIO_PD_PIN0                               1U         /**< GPIO pin PD0 is present. */
#define GPIO_PD_PIN1                               1U         /**< GPIO pin PD1 is present. */

/* Fixed Resource Locations */
#define GPIO_SWCLK_PORT                            GPIO_PA_INDEX /**< Port of SWCLK.*/
#define GPIO_SWCLK_PIN                             1U            /**< Pin of SWCLK.*/
#define GPIO_SWDIO_PORT                            GPIO_PA_INDEX /**< Port of SWDIO.*/
#define GPIO_SWDIO_PIN                             2U            /**< Pin of SWDIO.*/
#define GPIO_SWV_PORT                              GPIO_PA_INDEX /**< Port of SWV.*/
#define GPIO_SWV_PIN                               3U            /**< Pin of SWV.*/
#define GPIO_TDI_PORT                              GPIO_PA_INDEX /**< Port of TDI.*/
#define GPIO_TDI_PIN                               4U            /**< Pin of TDI.*/
#define GPIO_TDO_PORT                              GPIO_PA_INDEX /**< Port of TDO.*/
#define GPIO_TDO_PIN                               3U            /**< Pin of TDO.*/
#define GPIO_TRACECLK_PORT                         GPIO_PA_INDEX /**< Port of TRACECLK.*/
#define GPIO_TRACECLK_PIN                          4U            /**< Pin of TRACECLK.*/
#define GPIO_TRACEDATA0_PORT                       GPIO_PA_INDEX /**< Port of TRACEDATA0.*/
#define GPIO_TRACEDATA0_PIN                        3U            /**< Pin of TRACEDATA0.*/
#define GPIO_EM4WU0_PORT                           GPIO_PA_INDEX /**< Port of EM4WU0.*/
#define GPIO_EM4WU0_PIN                            5U            /**< Pin of EM4WU0.*/
#define GPIO_EM4WU3_PORT                           GPIO_PB_INDEX /**< Port of EM4WU3.*/
#define GPIO_EM4WU3_PIN                            1U            /**< Pin of EM4WU3.*/
#define GPIO_EM4WU6_PORT                           GPIO_PC_INDEX /**< Port of EM4WU6.*/
#define GPIO_EM4WU6_PIN                            0U            /**< Pin of EM4WU6.*/
#define GPIO_EM4WU7_PORT                           GPIO_PC_INDEX /**< Port of EM4WU7.*/
#define GPIO_EM4WU7_PIN                            5U            /**< Pin of EM4WU7.*/
#define GPIO_EM4WU9_PORT                           GPIO_PD_INDEX /**< Port of EM4WU9.*/
#define GPIO_EM4WU9_PIN                            2U            /**< Pin of EM4WU9.*/
#define LFXO_LFXTAL_I_PORT                         GPIO_PD_INDEX /**< Port of LFXTAL_I.*/
#define LFXO_LFXTAL_I_PIN                          1U            /**< Pin of LFXTAL_I.*/
#define LFXO_LFXTAL_O_PORT                         GPIO_PD_INDEX /**< Port of LFXTAL_O.*/
#define LFXO_LFXTAL_O_PIN                          0U            /**< Pin of LFXTAL_O.*/
#define LFXO_LF_EXTCLK_PORT                        GPIO_PD_INDEX /**< Port of LF_EXTCLK.*/
#define LFXO_LF_EXTCLK_PIN                         1U            /**< Pin of LF_EXTCLK.*/

/* Part number capabilities */
#define ACMP_PRESENT                                 /** ACMP is available in this part */
#define ACMP_COUNT                                 2 /** 2 ACMPs available  */
#define AGC_PRESENT                                  /** AGC is available in this part */
#define AGC_COUNT                                  1 /** 1 AGCs available  */
#define AMUXCP_PRESENT                               /** AMUXCP is available in this part */
#define AMUXCP_COUNT                               1 /** 1 AMUXCPs available  */
#define BUFC_PRESENT                                 /** BUFC is available in this part */
#define BUFC_COUNT                                 1 /** 1 BUFCs available  */
#define BURAM_PRESENT                                /** BURAM is available in this part */
#define BURAM_COUNT                                1 /** 1 BURAMs available  */
#define BURTC_PRESENT                                /** BURTC is available in this part */
#define BURTC_COUNT                                1 /** 1 BURTCs available  */
#define CMU_PRESENT                                  /** CMU is available in this part */
#define CMU_COUNT                                  1 /** 1 CMUs available  */
#define DPLL_PRESENT                                 /** DPLL is available in this part */
#define DPLL_COUNT                                 1 /** 1 DPLLs available  */
#define EMU_PRESENT                                  /** EMU is available in this part */
#define EMU_COUNT                                  1 /** 1 EMUs available  */
#define FRC_PRESENT                                  /** FRC is available in this part */
#define FRC_COUNT                                  1 /** 1 FRCs available  */
#define FSRCO_PRESENT                                /** FSRCO is available in this part */
#define FSRCO_COUNT                                1 /** 1 FSRCOs available  */
#define GPCRC_PRESENT                                /** GPCRC is available in this part */
#define GPCRC_COUNT                                1 /** 1 GPCRCs available  */
#define GPIO_PRESENT                                 /** GPIO is available in this part */
#define GPIO_COUNT                                 1 /** 1 GPIOs available  */
#define HFRCO_PRESENT                                /** HFRCO is available in this part */
#define HFRCO_COUNT                                1 /** 1 HFRCOs available  */
#define HFRCOEM23_PRESENT                            /** HFRCOEM23 is available in this part */
#define HFRCOEM23_COUNT                            1 /** 1 HFRCOEM23s available  */
#define HFXO_PRESENT                                 /** HFXO is available in this part */
#define HFXO_COUNT                                 1 /** 1 HFXOs available  */
#define I2C_PRESENT                                  /** I2C is available in this part */
#define I2C_COUNT                                  2 /** 2 I2Cs available  */
#define IADC_PRESENT                                 /** IADC is available in this part */
#define IADC_COUNT                                 1 /** 1 IADCs available  */
#define ICACHE_PRESENT                               /** ICACHE is available in this part */
#define ICACHE_COUNT                               1 /** 1 ICACHEs available  */
#define LDMA_PRESENT                                 /** LDMA is available in this part */
#define LDMA_COUNT                                 1 /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                             /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                             1 /** 1 LDMAXBARs available  */
#define LETIMER_PRESENT                              /** LETIMER is available in this part */
#define LETIMER_COUNT                              1 /** 1 LETIMERs available  */
#define LFRCO_PRESENT                                /** LFRCO is available in this part */
#define LFRCO_COUNT                                1 /** 1 LFRCOs available  */
#define LFXO_PRESENT                                 /** LFXO is available in this part */
#define LFXO_COUNT                                 1 /** 1 LFXOs available  */
#define LVGD_PRESENT                                 /** LVGD is available in this part */
#define LVGD_COUNT                                 1 /** 1 LVGDs available  */
#define MODEM_PRESENT                                /** MODEM is available in this part */
#define MODEM_COUNT                                1 /** 1 MODEMs available  */
#define MSC_PRESENT                                  /** MSC is available in this part */
#define MSC_COUNT                                  1 /** 1 MSCs available  */
#define PROTIMER_PRESENT                             /** PROTIMER is available in this part */
#define PROTIMER_COUNT                             1 /** 1 PROTIMERs available  */
#define PRS_PRESENT                                  /** PRS is available in this part */
#define PRS_COUNT                                  1 /** 1 PRSs available  */
#define RAC_PRESENT                                  /** RAC is available in this part */
#define RAC_COUNT                                  1 /** 1 RACs available  */
#define RADIOAES_PRESENT                             /** RADIOAES is available in this part */
#define RADIOAES_COUNT                             1 /** 1 RADIOAESs available  */
#define RFCRC_PRESENT                                /** RFCRC is available in this part */
#define RFCRC_COUNT                                1 /** 1 RFCRCs available  */
#define RTCC_PRESENT                                 /** RTCC is available in this part */
#define RTCC_COUNT                                 1 /** 1 RTCCs available  */
#define SEMAILBOX_PRESENT                            /** SEMAILBOX is available in this part */
#define SEMAILBOX_COUNT                            1 /** 1 SEMAILBOXs available  */
#define SMU_PRESENT                                  /** SMU is available in this part */
#define SMU_COUNT                                  1 /** 1 SMUs available  */
#define SYNTH_PRESENT                                /** SYNTH is available in this part */
#define SYNTH_COUNT                                1 /** 1 SYNTHs available  */
#define SYSCFG_PRESENT                               /** SYSCFG is available in this part */
#define SYSCFG_COUNT                               1 /** 1 SYSCFGs available  */
#define TIMER_PRESENT                                /** TIMER is available in this part */
#define TIMER_COUNT                                4 /** 4 TIMERs available  */
#define ULFRCO_PRESENT                               /** ULFRCO is available in this part */
#define ULFRCO_COUNT                               1 /** 1 ULFRCOs available  */
#define USART_PRESENT                                /** USART is available in this part */
#define USART_COUNT                                3 /** 3 USARTs available  */
#define WDOG_PRESENT                                 /** WDOG is available in this part */
#define WDOG_COUNT                                 2 /** 2 WDOGs available  */
#define DEVINFO_PRESENT                              /** DEVINFO is available in this part */
#define DEVINFO_COUNT                              1 /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core*/
#include "core_cm33.h"    /* Core Header File */
#include "system_bgm21.h" /* System Header File */

